using Serilog;
using System;
using System.Collections.Generic;
using System.Linq;


// В кругу стоят N человек, пронумерованных от 1 до N. При ведении счета по кругу (каждый 
// «раунд») вычёркивается каждый второй человек, пока не останется один. Составить программу,
// моделирующую процесс.
// Добавить возможность пользователю задавать N, а также простой консольный вывод, поэтапно 
// указывающий результат.
// Вариант со * - добавить пользователю возможность указывать, какой по номеру человек будет 
// вычеркиваться в каждом «раунде». В примере выше – каждый второй. Пользователь может задать,
// что вычеркиваться будет каждый: третий, пятый, шестнадцатый и так далее. Предусмотреть 
// варианты, когда «вычеркивание» невозможно, оповестить пользователя об этом.
// Невозможно вычеркнуть человека с номером больше, чем есть в кругу.
// Пример без *:
// ВЫВОД: Введите N
// ВВОД: 5
// ВЫВОД: Сгенерирован круг людей.Начинаем вычеркивать каждого второго.
// ВЫВОД: Раунд 1.Вычеркнут человек.Людей осталось: 4
// ВЫВОД: Раунд 2.Вычеркнут человек.Людей осталось: 3
// …
// ВЫВОД: Раунд 4.Вычеркнут человек.Людей осталось: 1
// ВЫВОД: Игра окончена. Невозможно вычеркнуть больше людей.
// Пример со *:
// ВЫВОД: Введите N:
// ВВОД: 5
// ВЫВОД: Введите, какой по счету человек будет вычеркнут каждый раунд:
// ВВОД: 3
// ВЫВОД: Раунд 1.Вычеркнут человек.Людей осталось: 4
// ВЫВОД: Раунд 2.Вычеркнут человек.Людей осталось: 3
//ВЫВОД: Раунд 3.Вычеркнут человек.Людей осталось: 2
//ВЫВОД: Игра окончена. Невозможно вычеркнуть больше людей.

namespace Task_3_1
{
    public class StartUp
    {
        public static List<string> GameRound(List<string> InputList, int deleteNumber)
        {
            for (int i = 0; i < InputList.Count; ++i)
                if ((i + 1) % deleteNumber == 0)
                {
                    InputList.RemoveAt(i);
                    return InputList;
                }
            return InputList;
        }

        public static void Main(string[] arg)
        {
            int _n = 0;
            int _deleteNumber = 0;

            Console.WriteLine("Введите N: ");
            while (!int.TryParse(Console.ReadLine(), out _n) || _n <= 0) 
            {
                Console.WriteLine("Вы ввели неверное число!");
                Console.WriteLine("Введите N: ");
            }


            Console.WriteLine("Введите, какой по счету человек будет вычеркнут каждый раунд: ");
            while (!int.TryParse(Console.ReadLine(), out _deleteNumber) || _deleteNumber <= 0||_deleteNumber>_n)
            {
                Console.WriteLine("Вы ввели неверное число!");
                Console.WriteLine("Введите, какой по счету человек будет вычеркнут каждый раунд: ");
            }



            // Init players list
            var players = new List<string>();

            for (int i = 0; i < _n; ++i) players.Add($"Player #{i + 1}");

            for (int i = 1; players.Count > _deleteNumber - 1; i++)
            {
                GameRound(players, _deleteNumber);
                Console.WriteLine($"Раунд {i}. Вычеркнут человек. Людей осталось: {players.Count} " + Environment.NewLine);
            }

            Console.WriteLine("Игра окончена, невозможно вычеркнуть больше людей.");
        }

    }

}
